import React from 'react';
import {Text, View} from 'react-native';
import Button from 'components/Button';
import {styles} from './style';

function ContactUs() {
  return (
    <View style={styles.container}>
      <View style={styles.buttonBlock}>
        <Text style={styles.version}>نسخه فعلی سناب ۹.۰.۵</Text>
        <Button title="به روزرسانی" btnType="blueBg" width={148} padding={5} />
      </View>
      <View style={styles.aboutUsWrapper}>
        <Text style={styles.aboutUs}>درباره ما</Text>
        <Text>
          این کتاب کوچک و کوتاه را می‌توان ادامهٔ مسخ کافکا دانست. در این داستان
          کوتاه، گریگور سامسا از موجودی دیگر مسخ و انسانی شده و است یعنی روندی
          ۱۸۰ درجه می باشد مخالف با روند داستانی مسخ ما یک انسان در آن، تبدیل به
          سوسک می‌شود. ما متوجه می‌شویم که و گریگور حشره بوده و حالا تبدیل به
          انسان شده است.فضاسازی و اینها ذخیره هاو خانه‌ای که سامسان در آن خود را
          می‌یابد ، با فضای تنگ و بستهٔ خانهٔ گریگور «مسخ» تفاوت دارد و نسبت به
          آن دارای حالت انها گشایش و فراخیی است .سامسایی که برای همه موراکامی
          قصه‌ٔ مسخ را روایت می‌کند ، در پایان حتی عاشق یک دختر جوان خمیده و
          قوزها می‌‌شود.با این‌که دختر زیبا نیست و قوز دارد، اما سامسای تازه
          انسان‌ شده ،عشق و در عاشقش می‌‌شود؛ لقمه‌ای اندازهٔ دهان خودش است (چون
          خودش هم بدن خوش‌اندامی ندارد) و تازه پایان داستان، شروع برای شناخت
          انسان، دنیای اطرافش و عشق است. داستانی شاید مورا کامی خواسته در مقابل
          «مسخ» بگوید که این‌گونه هم می‌شد یا که یا به‌عبارت‌دیگر از این طرف هم
          می‌توان مسخ شد یا شخصیت ها را مسخ کرد.
        </Text>
        <Text style={styles.specific}>ویژگی های ممتاز سناب</Text>
        <Text>
          این کتاب کوچک و کوتاه را می‌توان ادامهٔ مسخ کافکا دانست. در این داستان
          کوتاه، گریگور سامسا از موجودی دیگر مسخ و انسانی شده و است یعنی روندی
          ۱۸۰ درجه می باشد مخالف با روند داستانی مسخ ما یک انسان در آن، تبدیل به
          سوسک می‌شود. ما متوجه می‌شویم که و گریگور حشره بوده و حالا تبدیل به
          انسان شده است.
        </Text>
      </View>
    </View>
  );
}
export default ContactUs;
